export const orderTypes = [
  {label: "none", value: 0},
  {label: "купівлі-продажу", value: 1},
  {label: "дарування", value: 2},
  {label: "оренди", value: 3},
  {label: "іпотеки", value: 4},
  {label: "попередній", value: 5},  
];

export const orderObjects = [
  {label: "none", value: 0},
  {label: "квартири", value: 1},
  {label: "житлового будинку", value: 2},
];

export const month = ['','січень', 'лютий','березень','квітень','травень','червень','липень','серпень','вересень','жовтень','листопад','грудень'];
export const days = [
     ['','один','два','три','чотири','п’ять','шість','сім','вісім','дев’ять'],
	 ['десять','одинадцять','дванадцять','тринадцять','чотирнадцять','п’ятнадцять','шістнадцять','сімнадцять','вісімнадцять','дев’ятнадцять'],
	 ['','',' двадцять',' тридцять',' сорок',' п’ятдесят',' шістдесят',' сімдесят',' вісімдесят',' дев’яносто'],
	 ['',' сто',' двісті',' триста',' чотириста',' п’ятсот',' шістсот',' сімсот',' вісімсот',' дев’ятсот'],
	 ['',' одна',' дві']
      ];   
export const days_new = ['','першого','другого','третього','четвертого','п’ятого','шостого','сьомого','восьмого','дев’ятого'];

// export const allRegions = [
// 	 {value: "26", label: "м.Київ"},
// 	 {value: "1", label: "Автономна Республіка Крим"},
// 	 {value: "2", label: "Вінницька обл."},
// 	 {value: "3", label: "Волинська обл."},
// 	 {value: "4", label: "Дніпропетровська обл."},
// 	 {value: "5", label: "Донецька обл."},
// 	 {value: "6", label: "Житомирська обл."},
// 	 {value: "7", label: "Закарпатська обл."},
// 	 {value: "8", label: "Запорізька обл."},
// 	 {value: "9", label: "Івано-Франківська обл."},
// 	 {value: "10", label: "Київська обл."},
// 	 {value: "11", label: "Кіровоградська обл."},
// 	 {value: "12", label: "Луганська обл."},
// 	 {value: "13", label: "Львівська обл."},
// 	 {value: "14", label: "Миколаївська обл."},
// 	 {value: "27", label: "м.Севастополь"},
// 	 {value: "15", label: "Одеська обл."},
// 	 {value: "16", label: "Полтавська обл."},
// 	 {value: "17", label: "Рівненська обл."},
// 	 {value: "18", label: "Сумська обл."},
// 	 {value: "19", label: "Тернопільська обл."},
// 	 {value: "20", label: "Харківська обл."},
// 	 {value: "21", label: "Херсонська обл."},
// 	 {value: "22", label: "Хмельницька обл."},
// 	 {value: "23", label: "Черкаська обл."},
// 	 {value: "24", label: "Чернівецька обл."},
// 	 {value: "25", label: "Чернігівська обл."},

// ];
